// for-1練習
// for (i = 1; i<10 ; i++){
//     for (j=1 ; j<10 ; j++){
//         console.log(i*j);
//     } 
// }

// for-arr練習

// let obj=[
//     {
//         month:"1月",
//         flower:"風信子／水仙／紫羅蘭"
//     },
//     {
//         month:"2月",
//         flower:"勿忘我／海石竹／櫻草"
//     },
//     {
//         month:"3月",
//         flower:"矢車菊／雛菊／水仙"
//     },
//     {
//         month:"4月",
//         flower:"金盞花／山茶花 ／銀蓮花"
//     },
//     {
//         month:"5月",
//         flower:"蒲公英／歐丁香（洋丁香）／鈴蘭"
//     },
// ]

// for (i=0 ; i<obj.length ; i++){
//     console.log(`出生月份是`+obj[i].month+`的你，代表的花是"`+obj[i].flower+`"`);
// }


const data = [
    {
      "年": 107,
      "月": 1,
      "總運量": 275360,
      "日均運量": 8883,
      "假日均運量": 15132,
      "月台上刷卡日均筆數": 1734.2,
      "車上刷卡日均筆數": 5495.9,
      "售票機日均筆數": 1516.8,
      "補票日均筆數": 9.4,
      "團體票日均筆數": 126.3
    },
    {
      "年": 107,
      "月": 2,
      "總運量": 413815,
      "日均運量": 14779,
      "假日均運量": 20738,
      "月台上刷卡日均筆數": 3854.9,
      "車上刷卡日均筆數": 9039.8,
      "售票機日均筆數": 1754.9,
      "補票日均筆數": 11.9,
      "團體票日均筆數": 117.7
    },
    {
      "年": 107,
      "月": 3,
      "總運量": 209783,
      "日均運量": 6767,
      "假日均運量": 13198,
      "月台上刷卡日均筆數": 1413.2,
      "車上刷卡日均筆數": 4487.5,
      "售票機日均筆數": 660.7,
      "補票日均筆數": 6.5,
      "團體票日均筆數": 199.2
    },
    {
      "年": 107,
      "月": 4,
      "總運量": 283651,
      "日均運量": 9455,
      "假日均運量": 16656,
      "月台上刷卡日均筆數": 2183.7,
      "車上刷卡日均筆數": 6013.8,
      "售票機日均筆數": 944.5,
      "補票日均筆數": 6.3,
      "團體票日均筆數": 306.8
    },
    {
      "年": 107,
      "月": 5,
      "總運量": 206325,
      "日均運量": 6656,
      "假日均運量": 11573,
      "月台上刷卡日均筆數": 1385.8,
      "車上刷卡日均筆數": 4331.5,
      "售票機日均筆數": 558.6,
      "補票日均筆數": 7.1,
      "團體票日均筆數": 372.7
    },
    {
      "年": 107,
      "月": 6,
      "總運量": 213372,
      "日均運量": 7112,
      "假日均運量": 11818,
      "月台上刷卡日均筆數": 1601.2,
      "車上刷卡日均筆數": 4673,
      "售票機日均筆數": 644.2,
      "補票日均筆數": 7,
      "團體票日均筆數": 186.9
    },
    {
      "年": 107,
      "月": 7,
      "總運量": 323385,
      "日均運量": 10432,
      "假日均運量": 17413,
      "月台上刷卡日均筆數": 2669.9,
      "車上刷卡日均筆數": 6592.6,
      "售票機日均筆數": 1011.1,
      "補票日均筆數": 7.5,
      "團體票日均筆數": 150.7
    },
    {
      "年": 107,
      "月": 8,
      "總運量": 296078,
      "日均運量": 9551,
      "假日均運量": 16335,
      "月台上刷卡日均筆數": 2372.6,
      "車上刷卡日均筆數": 6129.6,
      "售票機日均筆數": 897.9,
      "補票日均筆數": 5.2,
      "團體票日均筆數": 145.6
    },
    {
      "年": 107,
      "月": 9,
      "總運量": 218813,
      "日均運量": 7294,
      "假日均運量": 12596,
      "月台上刷卡日均筆數": 1762.7,
      "車上刷卡日均筆數": 4751.6,
      "售票機日均筆數": 613.3,
      "補票日均筆數": 6.5,
      "團體票日均筆數": 159.8
    },
    {
      "年": 107,
      "月": 10,
      "總運量": 229454,
      "日均運量": 7402,
      "假日均運量": 14376,
      "月台上刷卡日均筆數": 1712.2,
      "車上刷卡日均筆數": 4730.2,
      "售票機日均筆數": 617.5,
      "補票日均筆數": 6.5,
      "團體票日均筆數": 335.3
    },
    {
      "年": 107,
      "月": 11,
      "總運量": 260255,
      "日均運量": 8675,
      "假日均運量": 15874,
      "月台上刷卡日均筆數": 2036.2,
      "車上刷卡日均筆數": 5498.7,
      "售票機日均筆數": 742,
      "補票日均筆數": 15.2,
      "團體票日均筆數": 383.1
    },
    {
      "年": 107,
      "月": 12,
      "總運量": 436179,
      "日均運量": 14070,
      "假日均運量": 25672,
      "月台上刷卡日均筆數": 3542.5,
      "車上刷卡日均筆數": 9025,
      "售票機日均筆數": 1201.3,
      "補票日均筆數": 18.4,
      "團體票日均筆數": 283.1
    },
    {
      "年": 108,
      "月": 1,
      "總運量": 310193,
      "日均運量": 10006,
      "假日均運量": 15375,
      "月台上刷卡日均筆數": 2713,
      "車上刷卡日均筆數": 6238.8,
      "售票機日均筆數": 783.2,
      "補票日均筆數": 11.5,
      "團體票日均筆數": 259.7
    },
    {
      "年": 108,
      "月": 2,
      "總運量": 431570,
      "日均運量": 15413,
      "假日均運量": 24853,
      "月台上刷卡日均筆數": 5475.3,
      "車上刷卡日均筆數": 8246.8,
      "售票機日均筆數": 1515.5,
      "補票日均筆數": 10.9,
      "團體票日均筆數": 164.7
    },
    {
      "年": 108,
      "月": 3,
      "總運量": 275955,
      "日均運量": 8902,
      "假日均運量": 15843,
      "月台上刷卡日均筆數": 2661.5,
      "車上刷卡日均筆數": 5187.8,
      "售票機日均筆數": 721.4,
      "補票日均筆數": 9.2,
      "團體票日均筆數": 321.9
    },
    {
      "年": 108,
      "月": 4,
      "總運量": 264712,
      "日均運量": 8824,
      "假日均運量": 15474,
      "月台上刷卡日均筆數": 2437.2,
      "車上刷卡日均筆數": 5154.6,
      "售票機日均筆數": 734.7,
      "補票日均筆數": 10.6,
      "團體票日均筆數": 486.6
    },
    {
      "年": 108,
      "月": 5,
      "總運量": 235935,
      "日均運量": 7611,
      "假日均運量": 13610,
      "月台上刷卡日均筆數": 1974.3,
      "車上刷卡日均筆數": 4553.9,
      "售票機日均筆數": 537.6,
      "補票日均筆數": 12,
      "團體票日均筆數": 533
    },
    {
      "年": 108,
      "月": 6,
      "總運量": 247325,
      "日均運量": 8244,
      "假日均運量": 13216,
      "月台上刷卡日均筆數": 2129,
      "車上刷卡日均筆數": 5248.9,
      "售票機日均筆數": 622.4,
      "補票日均筆數": 6.7,
      "團體票日均筆數": 237.2
    },
    {
      "年": 108,
      "月": 7,
      "總運量": 298947,
      "日均運量": 9643,
      "假日均運量": 15661,
      "月台上刷卡日均筆數": 2622.6,
      "車上刷卡日均筆數": 6066.3,
      "售票機日均筆數": 763.8,
      "補票日均筆數": 9.4,
      "團體票日均筆數": 181.4
    },
    {
      "年": 108,
      "月": 8,
      "總運量": 263550,
      "日均運量": 8502,
      "假日均運量": 12056,
      "月台上刷卡日均筆數": 2263.5,
      "車上刷卡日均筆數": 5440.4,
      "售票機日均筆數": 667.5,
      "補票日均筆數": 7.5,
      "團體票日均筆數": 122.7
    },
    {
      "年": 108,
      "月": 9,
      "總運量": 215037,
      "日均運量": 7168,
      "假日均運量": 12737,
      "月台上刷卡日均筆數": 1825.6,
      "車上刷卡日均筆數": 4551.6,
      "售票機日均筆數": 488.8,
      "補票日均筆數": 9.3,
      "團體票日均筆數": 292.6
    },
    {
      "年": 108,
      "月": 10,
      "總運量": 253939,
      "日均運量": 8465,
      "假日均運量": 16603,
      "月台上刷卡日均筆數": 2219.3,
      "車上刷卡日均筆數": 5288.3,
      "售票機日均筆數": 620,
      "補票日均筆數": 8.7,
      "團體票日均筆數": 328.4
    },
    {
      "年": 108,
      "月": 11,
      "總運量": 237975,
      "日均運量": 7933,
      "假日均運量": 14230,
      "月台上刷卡日均筆數": 1952.6,
      "車上刷卡日均筆數": 5073,
      "售票機日均筆數": 554.8,
      "補票日均筆數": 10.2,
      "團體票日均筆數": 341.9
    },
    {
      "年": 108,
      "月": 12,
      "總運量": 305358,
      "日均運量": 9850,
      "假日均運量": 17483,
      "月台上刷卡日均筆數": 2621.3,
      "車上刷卡日均筆數": 6258.2,
      "售票機日均筆數": 728.2,
      "補票日均筆數": 12.5,
      "團體票日均筆數": 230
    },
    {
      "年": 109,
      "月": 1,
      "總運量": 322245,
      "日均運量": 10395,
      "假日均運量": 15021,
      "月台上刷卡日均筆數": 2808.5,
      "車上刷卡日均筆數": 6663.2,
      "售票機日均筆數": 786.7,
      "人工售票日均筆數": 136.6
    },
    {
      "年": 109,
      "月": 2,
      "總運量": 159742,
      "日均運量": 5508,
      "假日均運量": 7656,
      "月台上刷卡日均筆數": 1522.2,
      "車上刷卡日均筆數": 3597.2,
      "售票機日均筆數": 365.8,
      "人工售票日均筆數": 23.2
    },
    {
      "年": 109,
      "月": 3,
      "總運量": 89264,
      "日均運量": 2879,
      "假日均運量": 4824,
      "月台上刷卡日均筆數": 821.4,
      "車上刷卡日均筆數": 1910.2,
      "售票機日均筆數": 141.7,
      "人工售票日均筆數": 6.2
    },
    {
      "年": 109,
      "月": 4,
      "總運量": 68436,
      "日均運量": 2281,
      "假日均運量": 3546,
      "月台上刷卡日均筆數": 669.3,
      "車上刷卡日均筆數": 1501.6,
      "售票機日均筆數": 105.9,
      "人工售票日均筆數": 4.3
    },
    {
      "年": 109,
      "月": 5,
      "總運量": 95998,
      "日均運量": 3097,
      "假日均運量": 5070,
      "月台上刷卡日均筆數": 847.7,
      "車上刷卡日均筆數": 2098,
      "售票機日均筆數": 142.6,
      "人工售票日均筆數": 8.4
    },
    {
      "年": 109,
      "月": 6,
      "總運量": 169670,
      "日均運量": 5656,
      "假日均運量": 10415,
      "月台上刷卡日均筆數": 1732.1,
      "車上刷卡日均筆數": 3534.9,
      "售票機日均筆數": 312.3,
      "人工售票日均筆數": 76.3
    },
    {
      "年": 109,
      "月": 7,
      "總運量": 250342,
      "日均運量": 8076,
      "假日均運量": 12797,
      "月台上刷卡日均筆數": 2315.1,
      "車上刷卡日均筆數": 5239.5,
      "售票機日均筆數": 435.6,
      "人工售票日均筆數": 85.3
    },
    {
      "年": 109,
      "月": 8,
      "總運量": 272692,
      "日均運量": 8797,
      "假日均運量": 13582,
      "月台上刷卡日均筆數": 2459.6,
      "車上刷卡日均筆數": 5735.5,
      "售票機日均筆數": 482.4,
      "人工售票日均筆數": 119.1
    },
    {
      "年": 109,
      "月": 9,
      "總運量": 173801,
      "日均運量": 5793,
      "假日均運量": 11071,
      "月台上刷卡日均筆數": 1500.3,
      "車上刷卡日均筆數": 3817.3,
      "售票機日均筆數": 242.5,
      "人工售票日均筆數": 233.2
    },
    {
      "年": 109,
      "月": 10,
      "總運量": 249700,
      "日均運量": 8055,
      "假日均運量": 14058,
      "月台上刷卡日均筆數": 2553.5,
      "車上刷卡日均筆數": 4875,
      "售票機日均筆數": 416.6,
      "人工售票日均筆數": 209.7
    },
    {
      "年": 109,
      "月": 11,
      "總運量": 207234,
      "日均運量": 6908,
      "假日均運量": 13274,
      "月台上刷卡日均筆數": 2208.1,
      "車上刷卡日均筆數": 4152.2,
      "售票機日均筆數": 347.5,
      "人工售票日均筆數": 200
    },
    {
      "年": 109,
      "月": 12,
      "總運量": 264230,
      "日均運量": 8524,
      "假日均運量": 16472,
      "月台上刷卡日均筆數": 2573.6,
      "車上刷卡日均筆數": 5370.9,
      "售票機日均筆數": 456.5,
      "人工售票日均筆數": 122.6
    },
    {
      "年": 110,
      "月": 1,
      "總運量": 398956,
      "日均運量": 12870,
      "假日均運量": 22079,
      "月台上刷卡日均筆數": 3301.7,
      "車上刷卡日均筆數": 6014.4,
      "售票機日均筆數": 629.1,
      "人工售票日均筆數": 60.6,
      "備註": "1/1-1/11運量+1/12起大南環段試營運免費搭乘，運量採車站人員人工回報及透過CCTV點數搭乘人數方式計算"
    },
    {
      "年": 110,
      "月": 2,
      "總運量": 593532,
      "日均運量": 21198,
      "假日均運量": 33401,
      "月台上刷卡日均筆數": 0,
      "車上刷卡日均筆數": 0,
      "售票機日均筆數": 0,
      "人工售票日均筆數": 0,
      "備註": "免費搭乘(免刷卡)至2/28，運量採車站人員人工回報及透過CCTV點數搭乘人數方式計算"
    },
    {
      "年": 110,
      "月": 3,
      "總運量": 263930,
      "日均運量": 8514,
      "假日均運量": 15403,
      "月台上刷卡日均筆數": 2514.7,
      "車上刷卡日均筆數": 5518,
      "售票機日均筆數": 394.6,
      "人工售票日均筆數": 86.5,
      "備註": ""
    },
    {
      "年": 110,
      "月": 4,
      "總運量": 284300,
      "日均運量": 9477,
      "假日均運量": 16038,
      "月台上刷卡日均筆數": 3006.5,
      "車上刷卡日均筆數": 5926.8,
      "售票機日均筆數": 424.8,
      "人工售票日均筆數": 118.6,
      "備註": ""
    },
    {
      "年": 110,
      "月": 5,
      "總運量": 133023,
      "日均運量": 4291,
      "假日均運量": 6463,
      "月台上刷卡日均筆數": 1423.9,
      "車上刷卡日均筆數": 2642.6,
      "售票機日均筆數": 172.2,
      "人工售票日均筆數": 52.4,
      "備註": ""
    },
    {
      "年": 110,
      "月": 6,
      "總運量": 29707,
      "日均運量": 990,
      "假日均運量": 855,
      "月台上刷卡日均筆數": 306.4,
      "車上刷卡日均筆數": 665.2,
      "售票機日均筆數": 18.3,
      "人工售票日均筆數": 0.4,
      "備註": ""
    },
    {
      "年": 110,
      "月": 7,
      "總運量": 64998,
      "日均運量": 2097,
      "假日均運量": 2251,
      "月台上刷卡日均筆數": 602.3,
      "車上刷卡日均筆數": 1430.3,
      "售票機日均筆數": 61.9,
      "人工售票日均筆數": 2.2,
      "備註": ""
    }
  ]


let newData = [];

  for (let i = 0; i<data.length ; i++){
    if (data[i].總運量 >= 300000){
      let month = {};
      month[`年`] = data[i][`年`];
      month[`月`] = data[i][`月`];
      // console.log(month);
      newData.push(month);
      // console.log(newData);
      // console.log(`近三年來有超過300000搭乘人次的`);
    }
  }

for (let j=0 ; j<newData.length ; j++){
  console.log(`近三年來有超過300000搭乘人次的是${newData[j]['年']}年，${newData[j][`月`]}月`);
  }

// 哈囉，oppok8872l:

// 我是六角學院助教 Yuko

// 程式碼是沒有太大問題的

// 但是物件的屬性若為中文、小數點或特殊字元

// 建議改用[] 來取值

// 如 airData['PM2.5']、data[i]['縣市']
